Revit 2026 API

# OpenOptionsSetOpenWorksetsConfiguration Method

---

Sets the object used to configure the worksets to open when the model is opened.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOpenWorksetsConfiguration(
	WorksetConfiguration openConfiguration
)
```
```vb
Public Sub SetOpenWorksetsConfiguration (
	openConfiguration As WorksetConfiguration
)
```
```cpp
public:
void SetOpenWorksetsConfiguration(
	WorksetConfiguration^ openConfiguration
)
```
```fsharp
member SetOpenWorksetsConfiguration :
        openConfiguration : WorksetConfiguration -> unit
```

#### Parameters

openConfiguration WorksetConfiguration
     The options. If , all user-created worksets will be opened.

These options are ignored for non-workshared models.

#### Reference

OpenOptions Class

Autodesk.Revit.DB Namespace